Revit 2024 API
ParameterTypeId.StairsRunBeginWithRiser Property
 "Begin with Riser": Begin with Riser
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsRunBeginWithRiser { get; }
Visual Basic
Public Shared ReadOnly Property StairsRunBeginWithRiser As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsRunBeginWithRiser {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace